{"config": [{"class_name": "Cropping2D", "config": {"input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s%\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0002\u0000d\u0003\u0000g\u0002\u0000\u0083\u0002\u0000S)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9(\u0000\u0000\u0000\u00e9\u00a0\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\bmodel.py\u00da\fresize_commaQ\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "name": "lambda_1", "output_shape": null, "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_2", "output_shape": null, "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "W_constraint": null, "trainable": true, "nb_col": 8, "subsample": [4, 4], "b_regularizer": null, "nb_filter": 16, "nb_row": 8, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "name": "convolution2d_1", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "W_constraint": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 32, "nb_row": 5, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "name": "convolution2d_2", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "W_constraint": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 64, "nb_row": 5, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "name": "convolution2d_3", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": 1920, "activation": "linear", "bias": true, "W_constraint": null, "name": "dense_1", "output_dim": 512}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": 512, "activation": "linear", "bias": true, "W_constraint": null, "name": "dense_2", "output_dim": 50}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": 50, "activation": "linear", "bias": true, "W_constraint": null, "name": "dense_3", "output_dim": 1}}], "keras_version": "1.2.1", "class_name": "Sequential"}